#include <stdio.h>
int main()
{
    int x;
    printf("x =");
    scanf("%d", &x);
    if ((x %10 == 1) && (x % 100) != 11)
    printf("Магнус поймал %d змею", x);
    if (x % 100 >= 11 && x % 100 <= 19)
    printf("Магнус поймал %d змей", x);
    if (x % 10 == 2 || x % 10 == 3 || x % 10 == 4 ) 
     printf("Магнус поймал %d змеи", x);
     if (x % 10 == 5 || x % 10 == 6 || x % 10 == 7 || x % 10 == 8 || x % 10 == 9 || x % 10 == 0 )  
     printf("Магнус поймал %d змей", x);
     return 0;
}